{
    "2015" : {
        "march" : {
            "speaker" : "Chris Sherry",
            "title" : "WordPress for the modern PHP developer",
            "avatar" : "https://pbs.twimg.com/profile_images/485030477086998529/OA2tXQgR_400x400.jpeg",
            "abstract" : "<p>It powers 23% of the internet, so its more than likely you are maintaining a codebase built on Wordpress. Many of these projects have outgrown their humble beginnings as blogs or websites and are now highly customised web applications. However the modern tools we use as PHP developers to aid our development, particularly in teams, can be tricky to utilise with the popular blogging platform. </p><p>This technical talk will guide you through how to make the use of Composer, Git and other tools familiar to PHP developers within your Wordpress install - and help you take back control of your themes, plugins, database and environments in a growing application.</p>",
            "feedbackUrl" : "https://joind.in/13715",
            "cues" : {
                "1": "00:02",
                "2": "00:04",
                "3": "00:09",
                "4": "00:14",
                "5": "00:15",
                "6": "00:29",
                "7": "00:34",
                "8": "00:58",
                "9": "01:02",
                "10": "01:10",
                "11" : "01:17",
                "12" : "01:51",
                "13" : "01:55",
                "14" : "01:58",
                "15" : "01:59",
                "16" : "02:05",
                "17" : "02:08",
                "18" : "02:12",
                "19" : "02:16",
                "20" : "02:29",
                "21" : "03:10",
                "22" : "03:19",
                "23" : "03:27",
                "24" : "04:12",
                "25" : "04:20",
                "26" : "04:22",
                "27" : "04:34",
                "28" : "04:53",
                "29" : "04:57",
                "30" : "05:42",
                "31" : "05:45",
                "32" : "05:49",
                "33" : "05:54",
                "34" : "06:05",
                "35" : "06:28",
                "36" : "06:49",
                "37" : "06:56",
                "38" : "07:55",
                "39" : "08:59",
                "40" : "09:06",
                "41" : "09:39",
                "42" : "09:48",
                "43" : "10:09",
                "44" : "10:19",
                "45" : "10:48",
                "46" : "11:27",
                "47" : "11:52",
                "48" : "12:05",
                "49" : "12:25",
                "50" : "12:52",
                "51" : "12:53",
                "52" : "13:01",
                "53" : "13:07",
                "54" : "13:13",
                "55" : "13:23",
                "56" : "13:30",
                "57" : "13:57",
                "58" : "14:24",
                "59" : "14:45",
                "60" : "14:49",
                "61" : "15:45",
                "62" : "16:04",
                "63" : "16:63",
                "64" : "17:32",
                "65" : "18:39",
                "66" : "19:24",
                "67" : "20:18",
                "68" : "20:26",
                "69" : "21:18",
                "70" : "22:02",
                "71" : "23:01",
                "72" : "23:35",
                "73" : "24:46",
                "74" : "25:09",
                "75" : "25:15",
                "76" : "25:23",
                "77" : "25:36",
                "78" : "25:54",
                "79" : "26:05",
                "80" : "27:06",
                "81" : "27:18",
                "82" : "27:29",
                "83" : "28:03",
                "84" : "30:09",
                "85" : "30:35",
                "86" : "30:37",
                "87" : "30:42",
                "88" : "30:45",
                "89" : "30:51",
                "90" : "30:55",
                "91" : "30:56",
                "92" : "31:43",
                "93" : "33:02",
                "94" : "33:28",
                "95" : "33:29",
                "96" : "34:43",
                "97" : "35:34",
                "98" : "35:53",
                "99" : "36:02",
                "100" : "36:34",
                "101" : "38:35",
                "102" : "39:26",
                "103" : "39:28",
                "104" : "30:30",
                "105" : "39:43",
                "106" : "39:53",
                "107" : "40:02",
                "108" : "40:06",
                "109" : "40:12",
                "1" : "40:22"
            },
            "video" : "http://player.vimeo.com/video/121300214"
        },
        "February" : {
            "speaker" : "Michael Cullum",
            "title" : "Getting off the island",
            "avatar" : "https://media.licdn.com/mpr/mpr/shrink_120_120/p/1/005/08c/1e2/19c174b.jpg",
            "abstract" : "<p>There are many FOSS projects out there - such as phpBB, Drupal, Wordpress, MyBB and Joomla - that are web applications designed for end-users and have, due to a range of factors, become very isolated from the rest of the open source community, which can only be a bad thing. Many of these projects are beginning to change their philosophies, but there is a long way to go. We’ll look at how frameworks, libraries, and the PHP FIG can help these projects to 'get off the island' and how we can shift the focus from creating communities to integrating them.</p>",
            "cues" : {}
        }
    },
    "2014": {
        "december" : {
            "speaker" : "Jenny Wong",
            "title" : "Integrating Communities",
            "avatar" : "https://pbs.twimg.com/profile_images/530065046655606784/RLnczv6S_400x400.jpeg",
            "abstract" : "<p>Is PHP one community or many?  Frameworks and CMSes created in PHP are popular enough to have self-sufficient communities, but this can often result in a lack of crossover between the communities. The result of the fragmentation is wasted effort and time as a developer but also a lack of knowledge transfer that extends outsides our own subgroup bubble.</p><p>This talk will bring some practical suggestions and solutions on how to look outside our comfort zones, widen our technical circles, and ensure that we learn from other peoples mistakes and bridge the gap between communities. As a result, we will make all our communities more diverse and stronger..</p>",
            "feedbackUrl" : "joind.in/event/view/3351",
            "cues" : {}
        },
        "november" : {
            "speaker" : "Stuart Herbert",
            "title" : "When To Mock",
            "avatar" : "http://www.stuartherbert.com/assets/mugshot_by_akrabat_crop_small.jpg",
            "abstract" : "<p>What are mocks, what are the consequences of using them, and when should you use them?</p>",
            "cues" : {},
            "video" : "http://player.vimeo.com/video/111983092"
        },
        "september" : {
            "speaker" : "Ollie Lawson",
            "title" : "Tales from inside an ISP",
            "avatar" : "/images/ollie.jpg",
            "abstract" : "<p>In 2006 a book seller popularised a concept from the 50s that has revolutionised the arena we work in. Although not the inventors of this technology Amazon has made large-scale computing bigger, faster and cheaper. In this era of multi-billion dollar data centres and everything-as-a-service is there a future for having your own “iron”?</p><p>The commoditisation of enterprise class hardware and software has meant that small scale organisations can have large scale infrastructure. Listen to how you can use all the tools at your disposal (yes, even DevOps) to get that hosting bill down and performance and security up.</p>"
        },
        "july" : {
            "speaker" : "Dave Baker",
            "title" : "Chat-Ops for Fun & Profit",
            "avatar" : "images/daveb.jpg",
            "abstract" : "<p>All Hail Our 'Bot Masters (or chat-ops for fun & profit)</p><p>As developers we spend the majority of our time on writing code for our products, clients, employers, open source projects etc, but how much extra stuff do we 'hack' together time and time again for those 1-off tasks that just aren't 1-off</p><p>We have been experimenting with a concept from Github known as Chat-Ops in which you tie your services into a chat client (HipChat, Campfire, Slack, IRC) and have a 'bot running with a variety of commands that can make your life easier, through notifications from Github pull requests, new issues, or server monitoring alerts, or even asking the bot to do deploys, check the server status, parse the logs (or retrieve images of ceiling cat)</p><p>This talk introduces hubot and some of the things we've been doing with it.</p>",
            "cues" : {},
            "video" : "http://player.vimeo.com/video/100841860"
        },
        "june" : {
            "speaker" : "James Titcumb",
            "title" : "Dip Your Toes in the Sea of Security",
            "avatar" : "/images/james.png",
            "abstract" : "Security is an enormous topic, and it’s really, really complicated. If you’re not careful, you’ll find yourself vulnerable to any number of attacks which you definitely don’t want to be on the receiving end of. This talk will give you just a taster of the vast array of things there is to know about security in modern web applications, such as writing secure PHP web applications and securing a Linux server. Whether you are writing anything beyond a basic brochure website, or even developing a complicated business web application, this talk will give you insights to some of the things you need to be aware of.",
            "cues" : {},
            "video" : "http://player.vimeo.com/video/97645043"
        },
        "may" : {
            "speaker" : "Simon Holywell",
            "title" : "Functional Programming",
            "avatar" : "https://pbs.twimg.com/profile_images/552579893968379904/Ihn1-_Nh_400x400.jpeg",
            "abstract" : "<p>In the PHP world functions are generally sneered at due to their simplicity and perceived as an evil side effect of spaghetti code. This is not necessarily the case however as when functions are combined in a logical manner they can be very powerful.</p><p>In fact they can be deployed to great effect in all manner of applications to create advanced and potentially less error prone software. This talk will take the form of a gentle introduction to functional programming concepts in a PHP context.</p><p>It will cater to a variety of levels of knowledge. Right from those who have never heard of functional programming to coders who have been practicing aspects for years in other languages (JavaScript!) - perhaps without even knowing.</p><p>During my talk you’ll hear some history, functional theory (introduced gently I promise) and of course some practical examples. You definitely do not need to be a mathematician or expert/functional coder to enjoy this session.</p>",
            "cues" : {},
            "video" : "http://player.vimeo.com/video/96925133"
        },
        "april": {
            "cues": {
                "1": "00:01",
                "2": "00:02",
                "3": "00:07",
                "4": "00:16",
                "5": "00:28",
                "6": "00:40",
                "7": "00:46",
                "8": "01:20",
                "9": "01:29",
                "10": "01:46",
                "11" : "01:55",
                "12" : "02:30",
                "13" : "02:32",
                "14" : "02:45",
                "15" : "02:48",
                "16" : "02:50",
                "17" : "03:03",
                "18" : "03:25",
                "19" : "03:38",
                "20" : "03:40",
                "21" : "04:03",
                "22" : "04:14",
                "23" : "04:39",
                "24" : "05:13",
                "25" : "05:20",
                "26" : "05:38",
                "27" : "05:43",
                "28" : "06:03",
                "29" : "06:10",
                "30" : "06:33",
                "31" : "07:24",
                "32" : "07:36",
                "33" : "07:54",
                "34" : "08:25",
                "35" : "08:52",
                "36" : "09:20",
                "37" : "09:34",
                "38" : "10:11",
                "39" : "10:23",
                "40" : "10:25",
                "41" : "10:26",
                "42" : "10:31",
                "43" : "11:26",
                "44" : "11:42",
                "45" : "13:04",
                "46" : "13:40",
                "47" : "14:30",
                "48" : "14:43",
                "49" : "15:05",
                "50" : "16:03",
                "51" : "16:55"

            },
            "speaker" : "Dave Hulbert & Alex Ross",
            "title" : "Functional Programming",
            "avatar" : "/images/alexdave.jpg",
            "video" : "http://player.vimeo.com/video/91962484"
        }
    }
}