{
    "2015": {
        "december": {
            "1" : {
                "date": "2015-12-07",
                "speaker": "Dan Leech",
                "title": "The PHP Benchmark",
                "avatar": "/images/dantleech.png",
                "abstract": "Making performant systems is often a goal in web development. There are many ways to monitor and verify performance, from commercial services such as Newrelic, using profilers such as Blackfire or XDebug, or simply using Curl or Firebug. These methods, however, act upon the whole request. How should we measure and profile the performance of units of code?\n\nIn this talk Daniel Leech will talk about benchmarking code in PHP and will present a tool with which to do it: PHPBench.\n\nDaniel Leech is an open source PHP developer involved in the Symfony CMF and is the developer of PHPBench.",
                "twitter": "dantleech",
                "resources": {
                    "PHPBench": "http://www.phpbench.com/",
                    "Dan Leech": "http://www.dantleech.com/",
                    "Symfony CMF": "http://cmf.symfony.com/",
                    "PHP Content Repository": "http://phpcr.github.io/"
                }
            },
            "2" : {
                "date": "2015-12-07",
                "speaker": "Alex Ross",
                "title": "Faster Websites with PHP 7",
                "avatar": "/images/rossey.jpg",
                "abstract": "PHP 7 will be released in November 2015. With it’s impressive 100%+ speed improvements and lower memory usage find out about the new PHP 7 spaceships, return & scalar type hints\n\nAlex is an Engineer at Base where he is part of the team working on <a href='http://www.discoverpassenger.com/'>Passenger</a>, a mobile app platform set to revolutionise public transport.",
                "twitter": "rossey",
                "resources": {
                    "DUnit": "https://github.com/Vectorface/dunit",
                    "PHP 7 Dev Box": "https://github.com/rlerdorf/php7dev.git",
                    "Migrating PHP 5.6. to PHP 7": "http://php.net/manual/en/migration70.php",
                    "Speeding up the Web with PHP 7": "http://talks.php.net/fluent15#/",
                    "Getting Ready for PHP 7": "https://www.digitalocean.com/company/blog/getting-ready-for-php-7",
                    "What to expect in PHP 7": "https://blog.engineyard.com/2015/what-to-expect-php-7"
                }
            }
        },
        "november": {
            "1" : {
                "date": "2015-11-02",
                "speaker": "Jonathan Ginn",
                "title": "Taming Wordpress Theming with Twig & Timber",
                "avatar": "/images/jonginn.png",
                "abstract": "Fed up with WordPress' templating system or feel like it could be so much better?\n\n<strong>Timber is the answer.</strong>\n\nTimber turns WordPress into a logical system of templates and views, gifting you the full power of Twig (and more) to turn your WordPress theme into a powerful system of controllers and views, with sensible, reusable code. Whether you're a front-end dev or back-end dev, Timber is sure to make you love WordPress again.\n\nJon will run through the basics of Twig as a templating system and show the advanced opportunities for Wordpress developers that Timber offers.\n\nJon is a 'Developer Evangelist' at Base, splitting his time between front-end dev and running digital events in the Dorset area.",
                "twitter": "jonginn",
                "resources": {
                    "Twig": "http://twig.sensiolabs.org/",
                    "Timber": "http://upstatement.com/timber/",
                    "WordPress": "https://wordpress.org/"
                },
                "slides": "2015_november_jon.pdf"
            },
            "2" : {
                "date": "2015-11-02",
                "speaker": "Peter Ruczynski",
                "title": "Clean Code",
                "avatar": "/images/softbass.png",
                "abstract": "Clean code does not just mean making your code look tidy and neat. This brief talk aims to show you some techniques which will help you to improve your code so that it is easier to read, easier to maintain, easier to debug, easier to test and easier for others to work on.",
                "twitter": "softbass",
                "slides": "2015_november_peter.pdf"
            }
        },
        "october": {
          "1" : {
            "date": "2015-10-05",
            "speaker": "Dave Hulbert",
            "title": "Practical intro to using PhpSpec. AKA how to be lazy and write better code.",
            "avatar": "/images/dave.jpeg",
            "abstract": "PhpSpec is a tool for \"SpecBDD\". Basically test-driven development (TDD) but without the word \"test\" in it. This talk shows how to effectively use PhpSpec for fun and/or profit, and the advantages to using it along side other tools like PHPUnit and why it's \"literally\" made of awesomesauce. We'll start off with a breakneck primer on unit testing with PHPUnit and basic TDD concepts. Then we'll move on to getting set up with PhpSpec, followed by a guided tour of its main features. By the end of the talk you'll have techniques to take advantage of your natural inclination to laziness to actually help you write better code.",
            "twitter": "dave1010"
          }
        },
        "september": {
            "1" : {
                "date": "2015-09-07",
                "speaker": "James Titcumb",
                "title": "Diving into HHVM Extensions",
                "avatar": "/images/james.png",
                "abstract": "HHVM is currently gaining popularity at quite a pace, and it's a pretty exciting time for PHP runtimes. Have you ever wondered what is going on beneath this slick and super-speedy engine? I wondered that myself, so I dived into the internals of HHVM, discovering a treasure trove of awesome stuff. In this talk, I'll show you how HHVM itself works with a guided tour of the codebase, demonstrating how it all pieces together. I'll also show you a couple of ways to write your own incredible HHVM extension. You don't need to know C++ to understand this talk - just PHP language knowledge is enough.",
                "twitter": "asgrim",
                "video": "http://player.vimeo.com/video/139081731"
            },
            "2" : {
                "date": "2015-09-07",
                "speaker": "Marco Pivetta",
                "title": "Extremely defensive PHP",
                "avatar": "/images/ocramius.png",
                "abstract": "What if I told you that your carefully designed and tested code was fragile? What if I told you that you can trust nobody? What does \"fragile\" even mean? We are going to look at fragile code, fix it, and lastly learn about various Poka-Yoke techniques that make our code very hard to break.",
                "twitter": "ocramius",
                "video": "http://player.vimeo.com/video/140114867"
            }
        },
        "august": {
            "1" : {
                "speaker": "David Yell",
                "title": "Don't code, bake. An introduction to CakePHP",
                "avatar": "/images/yelldavid.jpg",
                "abstract": "Learn about CakePHP, the RAD PHP framework for awesome people. Find out why I love CakePHP and learn about all the things which make up the framework.",
                "twitter": "YellDavid"
            }
        },
        "july": {
            "1" : {
                "speaker": "Marcus Bointon",
                "title": "Modern networking for PHP developers",
                "avatar": "/images/SynchroM.jpg",
                "abstract": "Many developers are stuck in the world of old-school IPv4 - it's an easy and comfortable place to be! But beneath the cosy world of PHP, your network layer has been undergoing major changes that might be outside your comfort zone. IPv6, SPDY (aka HTTP/2.0) and SSL are all important technologies that you need to get to grips with, both inside and outside PHP. This talk covers the key features of these technologies and how you can use them to improve your app's availability, performance and security",
                "twitter": "SynchroM"
            }
        },
        "june": {
            "1" : {
                "speaker": "Christopher Hoult",
                "title": "Your API is a UI",
                "avatar": "/images/chault.jpg",
                "abstract": "Whether you’re creating a complex web application or a simple library, everything you create has a user. Why, then, do we concentrate on our users when developing a user interface, but so often forget them when developing APIs? In this talk, Christopher presents a whirlwind overview of a variety of different User Experience considerations when designing your APIs.",
                "twitter": "choult"
            }
        },
        "april": {
            "1" : {
                "speaker": "Derick Rethans",
                "title": "Text wrangling and wordsmithing with MongoDB",
                "avatar": "/images/derickr.jpg",
                "abstract": "Text wrangling and wordsmithing with MongoDB",
                "feedbackUrl": "https://joind.in/14372",
                "twitter": "derickr",
                "slides": "2015_april.pdf",
                "resources": {
                    "Derick Rethans": "http://derickrethans.nl/talks/textwrangling-phpdorset15",
                    "Atomic Operations": "http://www.mongodb.org/display/DOCS/Atomic+Operations",
                    "BSON Spec": "http://bsonspec.org/",
                    "Download MongoDB": "http://www.mongodb.org/downloads",
                    "Ghenghis": "http://genghisapp.com/",
                    "Google S2 Internals": "https://docs.google.com/presentation/d/1Hl4KapfAENAOf4gv-pSngKwvS_jwNVHRPZTTDzXXn6Q/view#slide=id.i0",
                    "Indexing Freeform-Tagged Data": "http://drck.me/freetagidx-9gm",
                    "London MongoDB UG": "http://www.meetup.com/London-MongoDB-User-Group",
                    "MongoDB Cursors with PHP": "http://drck.me/mongocur-9f8",
                    "MongoDB geohashes": "http://www.kchodorow.com/blog/2011/06/08/mongo-in-flatland/",
                    "Single machine replicaset tutorial": "http://www.mongodb.org/display/DOCS/Replica+Set+Tutorial"
                }
            }
        },
        "march": {
            "1" : {
                "speaker": "Chris Sherry",
                "title": "WordPress for the modern PHP developer",
                "avatar": "/images/chris.jpeg",
                "abstract": "<p>It powers 23% of the internet, so its more than likely you are maintaining a codebase built on Wordpress. Many of these projects have outgrown their humble beginnings as blogs or websites and are now highly customised web applications. However the modern tools we use as PHP developers to aid our development, particularly in teams, can be tricky to utilise with the popular blogging platform. </p><p>This technical talk will guide you through how to make the use of Composer, Git and other tools familiar to PHP developers within your Wordpress install - and help you take back control of your themes, plugins, database and environments in a growing application.</p>",
                "feedbackUrl": "https://joind.in/13715",
                "twitter": "tweetingsherry",
                "resources": {
                    "Base Orchestration and Synchronization Helper": "https://wearebase.com/about/blog/2015/deployment-database-and-asset-management/"
                },
                "slides": "2015_april.pdf",
                "cues": {
                    "1": "00:02",
                    "2": "00:04",
                    "3": "00:09",
                    "4": "00:14",
                    "5": "00:15",
                    "6": "00:29",
                    "7": "00:34",
                    "8": "00:58",
                    "9": "01:02",
                    "10": "01:10",
                    "11": "01:17",
                    "12": "01:51",
                    "13": "01:55",
                    "14": "01:58",
                    "15": "01:59",
                    "16": "02:05",
                    "17": "02:08",
                    "18": "02:12",
                    "19": "02:16",
                    "20": "02:29",
                    "21": "03:10",
                    "22": "03:19",
                    "23": "03:27",
                    "24": "04:12",
                    "25": "04:20",
                    "26": "04:22",
                    "27": "04:34",
                    "28": "04:53",
                    "29": "04:57",
                    "30": "05:42",
                    "31": "05:45",
                    "32": "05:49",
                    "33": "05:54",
                    "34": "06:05",
                    "35": "06:28",
                    "36": "06:49",
                    "37": "06:56",
                    "38": "07:55",
                    "39": "08:59",
                    "40": "09:06",
                    "41": "09:39",
                    "42": "09:48",
                    "43": "10:09",
                    "44": "10:19",
                    "45": "10:48",
                    "46": "11:27",
                    "47": "11:52",
                    "48": "12:05",
                    "49": "12:25",
                    "50": "12:52",
                    "51": "12:53",
                    "52": "13:01",
                    "53": "13:07",
                    "54": "13:13",
                    "55": "13:23",
                    "56": "13:30",
                    "57": "13:57",
                    "58": "14:24",
                    "59": "14:45",
                    "60": "14:49",
                    "61": "15:45",
                    "62": "16:04",
                    "63": "16:63",
                    "64": "17:32",
                    "65": "18:39",
                    "66": "19:24",
                    "67": "20:18",
                    "68": "20:26",
                    "69": "21:18",
                    "70": "22:02",
                    "71": "23:01",
                    "72": "23:35",
                    "73": "24:46",
                    "74": "25:09",
                    "75": "25:15",
                    "76": "25:23",
                    "77": "25:36",
                    "78": "25:54",
                    "79": "26:05",
                    "80": "27:06",
                    "81": "27:18",
                    "82": "27:29",
                    "83": "28:03",
                    "84": "30:09",
                    "85": "30:35",
                    "86": "30:37",
                    "87": "30:42",
                    "88": "30:45",
                    "89": "30:51",
                    "90": "30:55",
                    "91": "30:56",
                    "92": "31:43",
                    "93": "33:02",
                    "94": "33:28",
                    "95": "33:29",
                    "96": "34:43",
                    "97": "35:34",
                    "98": "35:53",
                    "99": "36:02",
                    "100": "36:34",
                    "101": "38:35",
                    "102": "39:26",
                    "103": "39:28",
                    "104": "30:30",
                    "105": "39:43",
                    "106": "39:53",
                    "107": "40:02",
                    "108": "40:06",
                    "109": "40:12",
                    "1": "40:22"
                },
                "video": "http://player.vimeo.com/video/121300214"
            }
        },
        "february": {
            "1" : {
                "speaker": "Michael Cullum",
                "title": "Getting off the island",
                "avatar": "/images/michaelc.jpg",
                "abstract": "<p>There are many FOSS projects out there - such as phpBB, Drupal, Wordpress, MyBB and Joomla - that are web applications designed for end-users and have, due to a range of factors, become very isolated from the rest of the open source community, which can only be a bad thing. Many of these projects are beginning to change their philosophies, but there is a long way to go. We’ll look at how frameworks, libraries, and the PHP FIG can help these projects to 'get off the island' and how we can shift the focus from creating communities to integrating them.</p>",
                "twitter": "michaelcullumuk",
                "cues": {}
            }
        }
    },
    "2014": {
        "december": {
            "1" : {
                "speaker": "Jenny Wong",
                "title": "Integrating Communities",
                "avatar": "/images/jenny.jpeg",
                "abstract": "<p>Is PHP one community or many?  Frameworks and CMSes created in PHP are popular enough to have self-sufficient communities, but this can often result in a lack of crossover between the communities. The result of the fragmentation is wasted effort and time as a developer but also a lack of knowledge transfer that extends outsides our own subgroup bubble.</p><p>This talk will bring some practical suggestions and solutions on how to look outside our comfort zones, widen our technical circles, and ensure that we learn from other peoples mistakes and bridge the gap between communities. As a result, we will make all our communities more diverse and stronger..</p>",
                "feedbackUrl": "joind.in/event/view/3351",
                "twitter": "miss_jwo",
                "cues": {}
            }
        },
        "november": {
            "1" : {
                "speaker": "Stuart Herbert",
                "title": "When To Mock",
                "avatar": "/images/stu.jpg",
                "abstract": "<p>What are mocks, what are the consequences of using them, and when should you use them?</p>",
                "twitter": "stuherbert",
                "cues": {},
                "video": "http://player.vimeo.com/video/111983092",
                "slides": "2014_november.pdf"
            }
        },
        "september": {
            "1" : {
                "speaker": "Ollie Lawson",
                "title": "Tales from inside an ISP",
                "avatar": "/images/ollie.jpg",
                "abstract": "<p>In 2006 a book seller popularised a concept from the 50s that has revolutionised the arena we work in. Although not the inventors of this technology Amazon has made large-scale computing bigger, faster and cheaper. In this era of multi-billion dollar data centres and everything-as-a-service is there a future for having your own “iron”?</p><p>The commoditisation of enterprise class hardware and software has meant that small scale organisations can have large scale infrastructure. Listen to how you can use all the tools at your disposal (yes, even DevOps) to get that hosting bill down and performance and security up.</p>",
                "twitter": "lwsndgtl",
                "cues": {}
            }
        },
        "july": {
            "1" : {
                "speaker": "Dave Baker",
                "title": "Chat-Ops for Fun & Profit",
                "avatar": "images/daveb.jpg",
                "abstract": "<p>All Hail Our 'Bot Masters (or chat-ops for fun & profit)</p><p>As developers we spend the majority of our time on writing code for our products, clients, employers, open source projects etc, but how much extra stuff do we 'hack' together time and time again for those 1-off tasks that just aren't 1-off</p><p>We have been experimenting with a concept from Github known as Chat-Ops in which you tie your services into a chat client (HipChat, Campfire, Slack, IRC) and have a 'bot running with a variety of commands that can make your life easier, through notifications from Github pull requests, new issues, or server monitoring alerts, or even asking the bot to do deploys, check the server status, parse the logs (or retrieve images of ceiling cat)</p><p>This talk introduces hubot and some of the things we've been doing with it.</p>",
                "twitter": "fully_baked",
                "cues": {},
                "video": "http://player.vimeo.com/video/100841860",
                "slides": "2014_july.pdf"
            }
        },
        "june": {
            "1" : {
                "speaker": "James Titcumb",
                "title": "Dip Your Toes in the Sea of Security",
                "avatar": "/images/james.png",
                "abstract": "Security is an enormous topic, and it’s really, really complicated. If you’re not careful, you’ll find yourself vulnerable to any number of attacks which you definitely don’t want to be on the receiving end of. This talk will give you just a taster of the vast array of things there is to know about security in modern web applications, such as writing secure PHP web applications and securing a Linux server. Whether you are writing anything beyond a basic brochure website, or even developing a complicated business web application, this talk will give you insights to some of the things you need to be aware of.",
                "twitter": "asgrim",
                "cues": {},
                "video": "http://player.vimeo.com/video/97645043",
                "slides": "2014_june.pdf"
            }
        },
        "may": {
            "1" : {
                "speaker": "Simon Holywell",
                "title": "Functional Programming",
                "avatar": "/images/simon.jpg",
                "abstract": "<p>In the PHP world functions are generally sneered at due to their simplicity and perceived as an evil side effect of spaghetti code. This is not necessarily the case however as when functions are combined in a logical manner they can be very powerful.</p><p>In fact they can be deployed to great effect in all manner of applications to create advanced and potentially less error prone software. This talk will take the form of a gentle introduction to functional programming concepts in a PHP context.</p><p>It will cater to a variety of levels of knowledge. Right from those who have never heard of functional programming to coders who have been practicing aspects for years in other languages (JavaScript!) - perhaps without even knowing.</p><p>During my talk you’ll hear some history, functional theory (introduced gently I promise) and of course some practical examples. You definitely do not need to be a mathematician or expert/functional coder to enjoy this session.</p>",
                "twitter": "treffynnon",
                "cues": {},
                "video": "http://player.vimeo.com/video/96925133",
                "slides": "2014_may.pdf"
            }
        },
        "april": {
            "1" : {
                "cues": {
                    "1": "00:01",
                    "2": "00:02",
                    "3": "00:07",
                    "4": "00:16",
                    "5": "00:28",
                    "6": "00:40",
                    "7": "00:46",
                    "8": "01:20",
                    "9": "01:29",
                    "10": "01:46",
                    "11": "01:55",
                    "12": "02:30",
                    "13": "02:32",
                    "14": "02:45",
                    "15": "02:48",
                    "16": "02:50",
                    "17": "03:03",
                    "18": "03:25",
                    "19": "03:38",
                    "20": "03:40",
                    "21": "04:03",
                    "22": "04:14",
                    "23": "04:39",
                    "24": "05:13",
                    "25": "05:20",
                    "26": "05:38",
                    "27": "05:43",
                    "28": "06:03",
                    "29": "06:10",
                    "30": "06:33",
                    "31": "07:24",
                    "32": "07:36",
                    "33": "07:54",
                    "34": "08:25",
                    "35": "08:52",
                    "36": "09:20",
                    "37": "09:34",
                    "38": "10:11",
                    "39": "10:23",
                    "40": "10:25",
                    "41": "10:26",
                    "42": "10:31",
                    "43": "11:26",
                    "44": "11:42",
                    "45": "13:04",
                    "46": "13:40",
                    "47": "14:30",
                    "48": "14:43",
                    "49": "15:05",
                    "50": "16:03",
                    "51": "16:55"

                },
                "speaker": "Dave Hulbert & Alex Ross",
                "title": "Silex and Twig",
                "avatar": "/images/alexdave.jpg",
                "video": "http://player.vimeo.com/video/91962484",
                "twitter": "dave1010",
                "slides": "2014_april.pdf"
            }
        },
        "march": {
            "1" : {
                "cues": {},
                "speaker": "Michael Heap",
                "title": "Vagrant and Ansible",
                "avatar": "/images/michael.jpg",
                "abstract": "<p>'It works on my box'. 'I don't have a day to help Dave set up his new PC'. 'I swear I had the same version installed!'</p><p>Sound familiar? It was for me too before I started using Vagrant and Ansible.</p><p>Vagrant is a tool for automating the creation of virtual machines. Of course, that's only half of the battle - once you have a machine you need to configure it. That's where Ansible comes in.</p><p>Ansible is a powerful server automation tool (think Puppet or Chef, but with a much lower learning curve), allowing you to install software and configure things as you need in a reproducible way.</p><p>By the end of this talk, everyone will be able to go home and create a Vagrant box that installs PHP, Apache2 and configures an example website with a custom VirtualHost in under 30 minutes.</p>",
                "twitter": "mheap",
                "resources": {
                    "Accompanying files": "https://github.com/mheap/phpnw-ansible-playbooks"
                }
            }
        }
    }
}
